finances = {
    'expenses': 'Расходы',
    'incomes': 'Доходы',
    'investments': 'Инвестиции',
    # 'table': 'Таблица',
    # 'settings': 'Настройки',
}

edit_op_menu = {
    'edit_category': 'Категория',
    'edit_amount': 'Сумма',
    'edit_comment': 'Коммент',
    'edit_date': 'Дата',
    'cancel_operation': 'Отмена',
    'set_regular': 'Регулярный',
    'set_another_op': 'Добавить след. операцию',
}

regular = {
    "month": "Месяц",
    "year": "Год",
}
# "three_days": "3 дня",
# "week": "Неделя",
# "quarter": "Квартал",


all_categories = {'products': '🛒 Продукты и хозтовары', 'snacks': '🍕 Вкусняшки', 'bus': '🚇Автобусы',
                      'taxi': '🚕 Такси ',
                      'clothes': '👕Одежда', 'gifts': '🎁 Подарки', 'leisure': '🎳 Досуг', 'emergency': '🚧 Непредвиденное',
                      'care': '🦷 Уход за собой', 'fast_food': '🍔 Еда вне дома', 'partner': '❤️ Партнер',
                      'education': '📚 Образование', 'communication': '🚰 К \\ У, связь', 'parents': 'Помощь родителям',
                      'housee': '🏡 Дом, ремонт', 'other': '🌎 Прочие', 'salary': '💵 Зарплата',
                      'underworking': '🛠️ Подработка', 'selling': '💲 Продажа вещей',
                      'cashback': '🪙Кэшбек', 'freelance': '💻 Фриланс', 'deal': '🤝 Услуги', 'deposits': '🏦 Вклады',
                      'stock': '📈 Акции', 'dividends': '💰 Дивиденды', 'crypto': '🎰 Крипта', }

# all_categories_lst = [{'id': str(index + 1), 'title': title} for index, title in enumerate(['🛒 Продукты и хозтовары', '🍕 Вкусняшки', '🚇Автобусы', '🚕 Такси ', '👕Одежда', '🎁 Подарки', '🎳 Досуг', '🚧 Непредвиденное', '🦷 Уход за собой', '🍔 Еда вне дома', '❤️ Партнер', '📚 Образование', '🚰 К \\ У, связь', 'Помощь родителям', '🏡 Дом, ремонт', '🌎 Прочие', '💵 Зарплата', '🛠️ Подработка', '💲 Продажа вещей', '🪙Кэшбек', '💻 Фриланс', '🤝 Услуги', '🏦 Вклады', '📈 Акции', '💰 Дивиденды', '🎰 Крипта'])]


table = 'Ссылка на таблицу\n\n Сделать в виде кнопки, а текстом данные о таблице\n\nдолжно выводиться как диалоговое окно, а не как простое сообщение'

settings = 'Меню настроек\n\n Сделать в виде кнопок, вероятно checkbox\n\nдолжно выводиться как диалоговое окно, а не как простое сообщение'

expenses = [{'id': str(index), 'title': title} for index, title in enumerate(['🛒 Продукты и хозтовары', '🍕 Вкусняшки', '🚇Автобусы', '🚕 Такси ', '👕Одежда', '🎁 Подарки', '🎳 Досуг', '🚧 Непредвиденное',
                                                                                  '🦷 Уход за собой', '🍔 Еда вне дома', '❤️ Партнер', '📚 Образование', '🚰 К/У, связь', 'Помощь родителям', '🏡 Дом, ремонт', '🌎 Прочие'])]

incomes = [{'id': str(index), 'title': title} for index, title in enumerate(['💵 Зарплата', '🛠️ Подработка', '💲 Продажа вещей', '🪙Кэшбек', '💻 Фриланс', '🤝 Услуги'])]


investments = [{'id': str(index), 'title': title} for index, title in enumerate(['🏦 Вклады', '📈 Акции', '💰 Дивиденды', '🎰 Крипта'])]