finances = {
    '1': 'Расходы',
    '2': 'Доходы',
    '3': 'Инвестиции',
    '4': 'Таблица',
    '5': 'Настройки',
}

expenses_dct = {'products': '🛒 Продукты и хозтовары', 'snacks': '🍕 Вкусняшки', 'bus': '🚇Автобусы',
                'taxi': '🚕 Такси ',
                'clothes': '👕Одежда', 'gifts': '🎁 Подарки', 'leisure': '🎳 Досуг', 'emergency': '🚧 Непредвиденное',
                'care': '🦷 Уход за собой', 'fast_food': '🍔 Еда вне дома', 'partner': '❤️ Партнер',
                'education': '📚 Образование', 'communication': '🚰 К \\ У, связь', 'parents': 'Помощь родителям',
                'housee': '🏡 Дом, ремонт', 'other': '🌎 Прочие'}  # , 'cancel': 'Отмена'
incomes_dct = {'salary': '💵 Зарплата', 'underworking': '🛠️ Подработка', 'selling': '💲 Продажа вещей',
               'cashback': '🪙Кэшбек', 'freelance': '💻 Фриланс', 'deal': '🤝 Услуги', }
investments_dct = {'deposits': '🏦 Вклады', 'stock': '📈 Акции', 'dividends': '💰 Дивиденды', 'crypto': '🎰 Крипта', }

table = 'Ссылка на таблицу\n\n Сделать в виде кнопки, а текстом данные о таблице\n\nдолжно выводиться как диалоговое окно, а не как простое сообщение'

settings = 'Меню настроек\n\n Сделать в виде кнопок, вероятно checkbox\n\nдолжно выводиться как диалоговое окно, а не как простое сообщение'

expenses = [
    {'id': '1', 'title': '🛒 Продукты и хозтовары'},
    {'id': '2', 'title': '🍕 Вкусняшки'},
    {'id': '3', 'title': '🚇Автобусы'},
    {'id': '4', 'title': '🚕 Такси '},
    {'id': '5', 'title': '👕Одежда'},
    {'id': '6', 'title': '🎁 Подарки'},
    {'id': '7', 'title': '🎳 Досуг'},
    {'id': '8', 'title': '🚧 Непредвиденное'},
    {'id': '9', 'title': '🦷 Уход за собой'},
    {'id': '10', 'title': '🍔 Еда вне дома'},
    {'id': '11', 'title': '❤️ Партнер'},
    {'id': '12', 'title': '📚 Образование'},
    {'id': '13', 'title': '🚰 К \ У, связь'},
    {'id': '14', 'title': 'Помощь родителям'},
    {'id': '15', 'title': '🏡 Дом, ремонт'},
    {'id': '16', 'title': '🌎 Прочие'}
]

investments = [
    {'id': '1', 'title': '🏦 Вклады'},
    {'id': '2', 'title': '📈 Акции'},
    {'id': '3', 'title': '💰 Дивиденды'},
    {'id': '4', 'title': '🎰 Крипта'}
]

incomes = [
    {'id': '1', 'title': '💵 Зарплата'},
    {'id': '2', 'title': '🛠️ Подработка'},
    {'id': '3', 'title': '💲 Продажа вещей'},
    {'id': '4', 'title': '🪙Кэшбек'},
    {'id': '5', 'title': '💻 Фриланс'},
    {'id': '6', 'title': '🤝 Услуги'}
]

# expenses = [{'id': '1', 'products': '🛒 Продукты и хозтовары'}, {'id': '2', 'snacks': '🍕 Вкусняшки'}, {'id': '3', 'bus': '🚇Автобусы'}, {'id': '4', 'taxi': '🚕 Такси '}, {'id': '5', 'clothes': '👕Одежда'}, {'id': '6', 'gifts': '🎁 Подарки'}, {'id': '7', 'leisure': '🎳 Досуг'}, {'id': '8', 'emergency': '🚧 Непредвиденное'}, {'id': '9', 'care': '🦷 Уход за собой'}, {'id': '10', 'fast_food': '🍔 Еда вне дома'}, {'id': '11', 'partner': '❤️ Партнер'}, {'id': '12', 'education': '📚 Образование'}, {'id': '13', 'communication': '🚰 К \\ У, связь'}, {'id': '14', 'parents': 'Помощь родителям'}, {'id': '15', 'housee': '🏡 Дом, ремонт'}, {'id': '16', 'other': '🌎 Прочие'}]
#
# investments = [{'id': '1', 'deposits': '🏦 Вклады'}, {'id': '2', 'stock': '📈 Акции'}, {'id': '3', 'dividends': '💰 Дивиденды'}, {'id': '4', 'crypto': '🎰 Крипта'}]
#
# incomes = [{'id': '1', 'salary': '💵 Зарплата'}, {'id': '2', 'underworking': '🛠️ Подработка'}, {'id': '3', 'selling': '💲 Продажа вещей'}, {'id': '4', 'cashback': '🪙Кэшбек'}, {'id': '5', 'freelance': '💻 Фриланс'}, {'id': '6', 'deal': '🤝 Услуги'}]
